Configuration/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Управляет логикой формы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Тип ограничивается в коде по виду операции</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>Отбор по Владельцу; скрывать по условию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Вводится вручную (нет ТЧ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Автозаполнение текущим пользователем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Configuration/Enums/ВидыОперацийРасходаДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходаДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/РасходныйКассовыйОрдер/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
        Ответственный = Пользователи.ТекущийПользователь();
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Реализация") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВозвратПокупателю;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ОплатаПоставщику;
	Иначе
		Возврат;
	КонецЕсли;

	ДокументОснование = ДанныеЗаполнения;
	Получатель        = ДанныеЗаполнения.Контрагент;
	Договор           = ДанныеЗаполнения.Договор;
	СуммаДокумента    = ДанныеЗаполнения.СуммаДокумента;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ДенежныеСредства.Записывать              = Истина;
    Движения.ДенежныеСредства.БлокироватьДляИзменения = Истина;
    Движения.Хозрасчетный.Записывать                  = Истина;

    Движение             = Движения.ДенежныеСредства.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период      = Дата;
    Движение.Организация = Организация;
    Движение.Касса       = Касса;
    Движение.Сумма       = СуммаДокумента;

    Движения.Записать();

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
    Запрос.УстановитьПараметр("Организация",   Организация);
    Запрос.УстановитьПараметр("Касса",         Касса);
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |    ПРЕДСТАВЛЕНИЕ(ДенежныеСредстваОстатки.Касса) КАК Касса,
    |    -ДенежныеСредстваОстатки.СуммаОстаток        КАК Сумма
    |ИЗ
    |    РегистрНакопления.ДенежныеСредства.Остатки(
    |        &МоментВремени,
    |        Организация = &Организация
    |        И Касса = &Касса) КАК ДенежныеСредстваОстатки
    |ГДЕ
    |    ДенежныеСредстваОстатки.СуммаОстаток < 0";

    РезультатЗапроса = Запрос.Выполнить();
    Если НЕ РезультатЗапроса.Пустой() Тогда
        Отказ = Истина;
        Выборка = РезультатЗапроса.Выбрать();
        Выборка.Следующий();
        ОбщегоНазначения.СообщитьПользователю(
            СтрШаблон("По кассе ""%1"" недостаточно средств для расхода в размере %2",
                Выборка.Касса, Выборка.Сумма));
    КонецЕсли;

    АналитикаПроводки = ПолучитьАналитикуПроводки();
    ДвижениеБух            = Движения.Хозрасчетный.Добавить();
    ДвижениеБух.Период     = Дата;
    ДвижениеБух.СчетДт     = АналитикаПроводки.СчетДебета;
    ДвижениеБух.СчетКт     = АналитикаПроводки.СчетКредита;
    ДвижениеБух.Сумма      = СуммаДокумента;
    ДвижениеБух.Содержание = АналитикаПроводки.СодержаниеОперации;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетДт, ДвижениеБух.СубконтоДт, АналитикаПроводки.СубконтоДебет);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(
        ДвижениеБух.СчетКт, ДвижениеБух.СубконтоКт, АналитикаПроводки.СубконтоКредит);

КонецПроцедуры


Функция ПолучитьАналитикуПроводки()
    АналитикаПроводки = Новый Структура;
    АналитикаПроводки.Вставить("СчетКредита",    ПланыСчетов.Хозрасчетный.Касса);
    АналитикаПроводки.Вставить("СубконтоКредит", Касса);
    Если ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ОплатаПоставщику Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Оплата поставщику наличными из кассы");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВозвратПокупателю Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Возврат покупателю наличными из кассы");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Выплата заработной платы наличными из кассы");
    ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику Тогда
        АналитикаПроводки.Вставить("СчетДебета",        ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
        АналитикаПроводки.Вставить("СубконтоДебет",     Получатель);
        АналитикаПроводки.Вставить("СодержаниеОперации", "Выдача денежных средств подотчётному лицу");
    КонецЕсли;
    Возврат АналитикаПроводки;
КонецФункции
